In [1]:
import numpy as np
import pandas as pd

In [3]:
date = pd.read_csv('./datasets/orders.csv')
time = pd.read_csv('./datasets/messages.csv')

In [5]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [7]:
time.head(20)

                   date                                                msg
0   2013-12-15 00:50:00                           ищу на сегодня мужика 37
1   2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2   2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3   2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4   2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
5   2016-03-08 22:52:00  пар.32прок.дев.на авто по ночн.городу.Днепр.06...
6   2014-02-18 00:23:00           Семейная пара познакомится для отношений
7   2012-11-23 01:10:00                  ДЛЯ С.П СНАЧАЛО СМС 066.679.400.8
8   2014-12-23 01:20:00  Дедушки ау вы где? СНЕГУРОЧКИ СКУЧАЮТ. Здесь е...
9   2012-11-03 23:46:00                     ищу парня с авто.063 528 90 72
10  2013-07-26 00:11:00  Хочу обшения на инт темы с девушкой 0500747823...
11  2013-12-18 00:39:00  открою дверь прохожему который хочет погреться...
12  2013-06-05 01:05:00                     .эксперементаторше. 0678676246
13  2016-11-27 22:29:00  Полненькая девушка ищет парня для серн.отн.Али...
14  2015-10-04 01:42:00                           парень ищет общения. 099
15  2012-08-24 23:13:00  Саша 4 Я знаю все о твоих письмах.Сколько это ...
16  2015-10-19 22:52:00  КТО СДЕЛАЕТ ПАРНЮ МАССАЖ ДЕВ ИЛИ 2 СЕЙЧАС 099 ...
17  2013-10-13 01:01:00  М.37 хочу общения с д/ж и не только. смс ммс з...
18  2016-01-19 22:33:00  Элегантная госпожа ищет мальчика на побегушках...
19  2014-03-17 23:16:00  МЗ9ПОЗНАК.СО СТРОЙНОЙ ДЕВ.С ДНЕПРА ДО З0 ДЛЯ С...

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [11]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Dates Handling

In [14]:
#converting to datetime dtype
date['date'] = pd.to_datetime(date['date'])

In [16]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

#### 1.  Extract Year

In [19]:
date['date_year'] = date['date'].dt.year

#### 2. Extract Month

In [22]:
date['date_month'] = date['date'].dt.month

In [24]:
date['date_month_name'] = date['date'].dt.month_name()

#### 3. Extract Days

In [27]:
date['date_day'] = date['date'].dt.day

#### 4. Day of Week

In [30]:
date['date_dow'] = date['date'].dt.dayofweek

#### 5. Week Name

In [33]:
date['date_dow_name'] = date['date'].dt.day_name()
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

#### 6. Is Weekend?

In [36]:
date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1, 0)
date.drop(columns = ['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

#### 7. Extract Week of the year

In [39]:
date['date_week'] = date['date'].dt.isocalendar().week
date.drop(columns=['product_id', 'city_id', 'orders']).head()

,date,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

#### 8. Extract Quarter

In [42]:
date['quarter'] = date['date'].dt.quarter

#### 9. Extract Semester

In [45]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

In [46]:
date.head()

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday,1,1,1,1

#### 10. Extract time elapsed between dates

In [49]:
import datetime
today = datetime.datetime.today() # today's date
today

datetime.datetime(2024, 10, 30, 23, 30, 31, 894740)

In [51]:
today - date['date']

0     1786 days 23:30:31.894740
1     2268 days 23:30:31.894740
2     2199 days 23:30:31.894740
3     1901 days 23:30:31.894740
4     2124 days 23:30:31.894740
                 ...
995   2214 days 23:30:31.894740
996   2155 days 23:30:31.894740
997   2003 days 23:30:31.894740
998   2068 days 23:30:31.894740
999   1842 days 23:30:31.894740
Name: date, Length: 1000, dtype: timedelta64[ns]

In [52]:
# days count
(today - date['date']).dt.days

0      1786
1      2268
2      2199
3      1901
4      2124
       ...
995    2214
996    2155
997    2003
998    2068
999    1842
Name: date, Length: 1000, dtype: int64

In [54]:
# months passed
np.round((today - date['date']) / np.timedelta64(1, 'm'), 0)

0      2573251.0
1      3267331.0
2      3167971.0
3      2738851.0
4      3059971.0
         ...
995    3189571.0
996    3104611.0
997    2885731.0
998    2979331.0
999    2653891.0
Name: date, Length: 1000, dtype: float64

# Time Handling

In [58]:
time

                    date                                                msg
0    2013-12-15 00:50:00                           ищу на сегодня мужика 37
1    2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2    2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3    2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4    2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                   ...                                                ...
995  2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996  2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997  2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998  2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999  2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [60]:
# converting to datetime dtype
time['date'] = pd.to_datetime(time['date'])

In [61]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [62]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

In [64]:
time.head(10)

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0
5,2016-03-08 22:52:00,пар.32прок.дев.на авто по ночн.городу.Днепр.06...,22,52,0
6,2014-02-18 00:23:00,Семейная пара познакомится для отношений,0,23,0
7,2012-11-23 01:10:00,ДЛЯ С.П СНАЧАЛО СМС 066.679.400.8,1,10,0
8,2014-12-23 01:20:00,Дедушки ау вы где? СНЕГУРОЧКИ СКУЧАЮТ. Здесь е...,1,20,0
9,2012-11-03 23:46:00,ищу парня с авто.063 528 90 72,23,46,0

In [66]:
# time difference
today - time['date']

0     3972 days 22:40:31.894740
1     3836 days 23:50:31.894740
2     4322 days 23:09:31.894740
3     3624 days 22:59:31.894740
4     4022 days 00:19:31.894740
                 ...
995   4611 days 22:40:31.894740
996   3933 days 00:16:31.894740
997   4397 days 23:53:31.894740
998   4513 days 23:56:31.894740
999   3786 days 00:05:31.894740
Name: date, Length: 1000, dtype: timedelta64[ns]